In [1]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine('oracle://scott:scott@oracle', echo=False)

In [2]:
import pandas as pd

In [113]:
emp_df=pd.read_sql_query('select * from emp',engine)
emp_df.head(10)

   empno   ename        job     mgr   hiredate     sal    comm  deptno
0   7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5   7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
6   7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7   7788   SCOTT    ANALYST  7566.0 1987-04-19  3000.0     NaN      20
8   7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
9   7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30

In [114]:
dept_df=pd.read_sql_query('select * from dept',engine)
dept_df.head(10)

   deptno       dname       loc
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [92]:
#check datatype of all columns in emp_df
emp_df.dtypes

empno                int64
ename               object
job                 object
mgr                float64
hiredate    datetime64[ns]
sal                float64
comm               float64
deptno               int64
dtype: object

# exercises we will cover in this blog
1. calc taxes for all employees
2. comm to sal ratio  %
3. avg salary of a dept
4. perform joins of data

# several methods to calculate taxes

In [115]:
def cal_taxes(sal):
    tax=0
    if sal >500 and sal <=1250:
        tax=sal*.125
    elif sal>1250 and sal<=1700:
        tax=sal*.175
    elif sal>1700 and sal<=2500:
        tax=sal*.225
    elif sal>2500:
        tax=sal*.275
    else:
        tax=0
    return tax

In [21]:
cal_taxes(800)

100.0

In [94]:
#emp_df['Tax']=list(map(cal_taxes,emp_df['sal']))
emp_df['Tax']=emp_df['sal'].map(cal_taxes)
emp_df.head(10)

#pandas map is use to apply a function on series
#in pandas a series is basically a dataframe with single column or a single column
#map works with a series

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,NaN,20,100.000
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30,280.000
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30,156.250
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,NaN,20,818.125
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30,156.250
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,NaN,30,783.750
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,NaN,10,551.250
7,7788,SCOTT,ANALYST,7566.0,1987-04-19,3000.0,NaN,20,825.000
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,NaN,10,1375.000
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,0.0,30,262.500

In [116]:
#using lambda
emp_df['tax']=emp_df['sal'].map(lambda x: x*.125 if x>500 and x<=1250 
                             else x*.175 if x>1250 and x<=1750
                             else x*.225 if x>1750 and x<2250
                            else x*.275 )
emp_df.head(10)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,tax
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,NaN,20,100.000
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30,280.000
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30,156.250
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,NaN,20,818.125
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30,156.250
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,NaN,30,783.750
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,NaN,10,673.750
7,7788,SCOTT,ANALYST,7566.0,1987-04-19,3000.0,NaN,20,825.000
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,NaN,10,1375.000
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,0.0,30,262.500

In [96]:
# tax can be caluclated with the help of another method calles apply()
#using lambda
emp_df['app_tax']=emp_df['sal'].apply(lambda x: x*.125 if x>500 and x<=1250 
                             else x*.175 if x>1250 and x<=1750 
                             else x*.225 if x>1750 and x<2250
                            else x*.275 )
emp_df.head(10)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax,tax,app_tax
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,NaN,20,100.000,100.000,100.000
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30,280.000,280.000,280.000
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30,156.250,156.250,156.250
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,NaN,20,818.125,818.125,818.125
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30,156.250,156.250,156.250
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,NaN,30,783.750,783.750,783.750
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,NaN,10,551.250,673.750,673.750
7,7788,SCOTT,ANALYST,7566.0,1987-04-19,3000.0,NaN,20,825.000,825.000,825.000
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,NaN,10,1375.000,1375.000,1375.000
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,0.0,30,262.500,262.500,262.500

# calc sal/comm ratio

In [117]:
#moving to next question comm/sal %
#as we have nulls in comm so % will not be a cleaned data
#lets replace nulls in comm with their respective salary values
emp_df['comm']=emp_df[['sal','comm']].apply(lambda x: x[0] 
                                            if (pd.isnull(x[1]) or int(x[1])==0) else x[1], axis=1)

In [100]:
emp_df.head(10)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,800.0,20,100.000
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30,280.000
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30,156.250
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,2975.0,20,818.125
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30,156.250
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,2850.0,30,783.750
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,2450.0,10,551.250
7,7788,SCOTT,ANALYST,7566.0,1987-04-19,3000.0,3000.0,20,825.000
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,5000.0,10,1375.000
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,1500.0,30,262.500

In [118]:
#lets drop two extra columns of dataframe
emp_df.drop(columns=['tax','app_tax'],inplace=True)

KeyError: "['app_tax'] not found in axis"

In [98]:
emp_df.head(10)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,NaN,20,100.000
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30,280.000
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30,156.250
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,NaN,20,818.125
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30,156.250
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,NaN,30,783.750
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,NaN,10,551.250
7,7788,SCOTT,ANALYST,7566.0,1987-04-19,3000.0,NaN,20,825.000
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,NaN,10,1375.000
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,0.0,30,262.500

In [119]:
emp_df['comm_%']=(emp_df['comm']/emp_df['sal'])*100
emp_df.head(10)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,tax,comm_%
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,800.0,20,100.000,100.00
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30,280.000,18.75
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30,156.250,40.00
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,2975.0,20,818.125,100.00
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30,156.250,112.00
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,2850.0,30,783.750,100.00
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,2450.0,10,673.750,100.00
7,7788,SCOTT,ANALYST,7566.0,1987-04-19,3000.0,3000.0,20,825.000,100.00
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,5000.0,10,1375.000,100.00
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,1500.0,30,262.500,100.00

# Calc Mediclaim Insurance Decuction from payroll

In [ ]:
emp_df['Mediclaim']=emp_df['sal'].map(lambda x: int(x)*.0125 if )

In [102]:
#lets take a scenario where we will flag comm_per column 
emp_df['Comm_Flag']=emp_df[['sal','comm']].apply(lambda x: 'Invalid' 
                                                 if int(x[0])==int(x[1]) else 'Valid',axis=1)
emp_df.head(10)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax,comm_%,Comm_Flag
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,800.0,20,100.000,100.00,Invalid
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30,280.000,18.75,Valid
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30,156.250,40.00,Valid
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,2975.0,20,818.125,100.00,Invalid
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30,156.250,112.00,Valid
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,2850.0,30,783.750,100.00,Invalid
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,2450.0,10,551.250,100.00,Invalid
7,7788,SCOTT,ANALYST,7566.0,1987-04-19,3000.0,3000.0,20,825.000,100.00,Invalid
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,5000.0,10,1375.000,100.00,Invalid
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,1500.0,30,262.500,100.00,Invalid

In [103]:
#create seperate dfs on basis of validity of commision 
comm_valid=emp_df[emp_df['Comm_Flag']=='Valid']
comm_valid.head(5)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax,comm_%,Comm_Flag
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30,280.00,18.75,Valid
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30,156.25,40.00,Valid
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30,156.25,112.00,Valid

In [60]:
comm_invalid=emp_df[emp_df['Comm_Flag']=='Invalid']
comm_invalid.head(10)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax,comm_%,Comm_Flag
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,800.0,20,100.000,100.0,Invalid
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,2975.0,20,818.125,100.0,Invalid
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,2850.0,30,783.750,100.0,Invalid
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,2450.0,10,551.250,100.0,Invalid
7,7788,SCOTT,ANALYST,7566.0,1987-04-19,3000.0,3000.0,20,825.000,100.0,Invalid
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,5000.0,10,1375.000,100.0,Invalid
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,1500.0,30,262.500,100.0,Invalid
10,7876,ADAMS,CLERK,7788.0,1987-05-23,1100.0,1100.0,20,137.500,100.0,Invalid
11,7900,JAMES,CLERK,7698.0,1981-12-03,950.0,950.0,30,118.750,100.0,Invalid
12,7902,FORD,ANALYST,7566.0,1981-12-03,3000.0,3000.0,20,825.000,100.0,Invalid

# avg salary deptwise

In [63]:
agg_sal=emp_df.groupby(['deptno'])['sal'].mean()
type(agg_sal)
print(agg_sal)

deptno
10    2916.666667
20    2175.000000
30    1566.666667
Name: sal, dtype: float64

In [104]:
#next step would be to merge the emp_df and series avg_sal
joined_df=pd.merge(emp_df,agg_sal,on='deptno')
joined_df

,empno,ename,job,mgr,hiredate,sal_x,comm,deptno,Tax,comm_%,Comm_Flag,sal_y
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,800.0,20,100.000,100.00,Invalid,2175.000000
1,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,2975.0,20,818.125,100.00,Invalid,2175.000000
2,7788,SCOTT,ANALYST,7566.0,1987-04-19,3000.0,3000.0,20,825.000,100.00,Invalid,2175.000000
3,7876,ADAMS,CLERK,7788.0,1987-05-23,1100.0,1100.0,20,137.500,100.00,Invalid,2175.000000
4,7902,FORD,ANALYST,7566.0,1981-12-03,3000.0,3000.0,20,825.000,100.00,Invalid,2175.000000
5,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30,280.000,18.75,Valid,1566.666667
6,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30,156.250,40.00,Valid,1566.666667
7,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30,156.250,112.00,Valid,1566.666667
8,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,2850.0,30,783.750,100.00,Invalid,1566.666667
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,1500.0,30,262.500,100.00,Invalid,1566.666667
10,7900,JAMES,CLERK,7698.0,1981-12-03,950.0,950.0,30,118.750,100.00,Invalid,1566.666667
11,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,2450.0,10,551.250,100.00,Invalid,2916.666667
12,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,5000.0,10,1375.000,100.00,Invalid,2916.666667
13,7934,MILLER,CLERK,7782.0,1982-01-23,1300.0,1300.0,10,227.500,100.00,Invalid,2916.666667

In [105]:
#rename columns to make data more meaningful
joined_df.rename(columns={'sal_x':'sal','sal_y':'avg_sal'},inplace=True)

In [106]:
#rop the comm_flag column as not required in output
joined_df.drop(columns='Comm_Flag',inplace=True)
joined_df.sort_values('deptno')

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax,comm_%,avg_sal
11,7782,CLARK,MANAGER,7839.0,1981-06-09,2450.0,2450.0,10,551.250,100.00,2916.666667
12,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,5000.0,10,1375.000,100.00,2916.666667
13,7934,MILLER,CLERK,7782.0,1982-01-23,1300.0,1300.0,10,227.500,100.00,2916.666667
0,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,800.0,20,100.000,100.00,2175.000000
1,7566,JONES,MANAGER,7839.0,1981-04-02,2975.0,2975.0,20,818.125,100.00,2175.000000
2,7788,SCOTT,ANALYST,7566.0,1987-04-19,3000.0,3000.0,20,825.000,100.00,2175.000000
3,7876,ADAMS,CLERK,7788.0,1987-05-23,1100.0,1100.0,20,137.500,100.00,2175.000000
4,7902,FORD,ANALYST,7566.0,1981-12-03,3000.0,3000.0,20,825.000,100.00,2175.000000
5,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30,280.000,18.75,1566.666667
6,7521,WARD,SALESMAN,7698.0,1981-02-22,1250.0,500.0,30,156.250,40.00,1566.666667
7,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250.0,1400.0,30,156.250,112.00,1566.666667
8,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850.0,2850.0,30,783.750,100.00,1566.666667
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500.0,1500.0,30,262.500,100.00,1566.666667
10,7900,JAMES,CLERK,7698.0,1981-12-03,950.0,950.0,30,118.750,100.00,1566.666667

In [108]:
#suppose there is a requirement from a downstream app, they have some specific job codes
#now convert job codes to as per the downstream app requirement
job_map={'MANAGER':'MGR','PRESIDENT':'Country_Head','CLERK':'CLK',
         'ANALYST':'SDE2','SALESMAN':'Sales&Marketing'}

#we have defined our mapping as per the downstream application requirement
#create a new dataframe with update job values
df=joined_df.replace({'job':job_map})
df

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax,comm_%,avg_sal
0,7369,SMITH,CLK,7902.0,1980-12-17,800.0,800.0,20,100.000,100.00,2175.000000
1,7566,JONES,MGR,7839.0,1981-04-02,2975.0,2975.0,20,818.125,100.00,2175.000000
2,7788,SCOTT,SDE2,7566.0,1987-04-19,3000.0,3000.0,20,825.000,100.00,2175.000000
3,7876,ADAMS,CLK,7788.0,1987-05-23,1100.0,1100.0,20,137.500,100.00,2175.000000
4,7902,FORD,SDE2,7566.0,1981-12-03,3000.0,3000.0,20,825.000,100.00,2175.000000
5,7499,ALLEN,Sales&Marketing,7698.0,1981-02-20,1600.0,300.0,30,280.000,18.75,1566.666667
6,7521,WARD,Sales&Marketing,7698.0,1981-02-22,1250.0,500.0,30,156.250,40.00,1566.666667
7,7654,MARTIN,Sales&Marketing,7698.0,1981-09-28,1250.0,1400.0,30,156.250,112.00,1566.666667
8,7698,BLAKE,MGR,7839.0,1981-05-01,2850.0,2850.0,30,783.750,100.00,1566.666667
9,7844,TURNER,Sales&Marketing,7698.0,1981-09-08,1500.0,1500.0,30,262.500,100.00,1566.666667
10,7900,JAMES,CLK,7698.0,1981-12-03,950.0,950.0,30,118.750,100.00,1566.666667
11,7782,CLARK,MGR,7839.0,1981-06-09,2450.0,2450.0,10,551.250,100.00,2916.666667
12,7839,KING,Country_Head,NaN,1981-11-17,5000.0,5000.0,10,1375.000,100.00,2916.666667
13,7934,MILLER,CLK,7782.0,1982-01-23,1300.0,1300.0,10,227.500,100.00,2916.666667

In [81]:
dept_df

   deptno       dname       loc
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [84]:
#in final step join df and dept_df to display deptnames of employees as well
final=pd.merge(df,dept_df[['deptno','dname','loc']],on='deptno',how='inner')
final

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax,comm_%,avg_sal,dname,loc
0,7369,SMITH,CLK,7902.0,1980-12-17,800.0,800.0,20,100.000,100.00,2175.000000,RESEARCH,DALLAS
1,7566,JONES,MGR,7839.0,1981-04-02,2975.0,2975.0,20,818.125,100.00,2175.000000,RESEARCH,DALLAS
2,7788,SCOTT,SDE2,7566.0,1987-04-19,3000.0,3000.0,20,825.000,100.00,2175.000000,RESEARCH,DALLAS
3,7876,ADAMS,CLK,7788.0,1987-05-23,1100.0,1100.0,20,137.500,100.00,2175.000000,RESEARCH,DALLAS
4,7902,FORD,SDE2,7566.0,1981-12-03,3000.0,3000.0,20,825.000,100.00,2175.000000,RESEARCH,DALLAS
5,7499,ALLEN,Sales&Marketing,7698.0,1981-02-20,1600.0,300.0,30,280.000,18.75,1566.666667,SALES,CHICAGO
6,7521,WARD,Sales&Marketing,7698.0,1981-02-22,1250.0,500.0,30,156.250,40.00,1566.666667,SALES,CHICAGO
7,7654,MARTIN,Sales&Marketing,7698.0,1981-09-28,1250.0,1400.0,30,156.250,112.00,1566.666667,SALES,CHICAGO
8,7698,BLAKE,MGR,7839.0,1981-05-01,2850.0,2850.0,30,783.750,100.00,1566.666667,SALES,CHICAGO
9,7844,TURNER,Sales&Marketing,7698.0,1981-09-08,1500.0,1500.0,30,262.500,100.00,1566.666667,SALES,CHICAGO
10,7900,JAMES,CLK,7698.0,1981-12-03,950.0,950.0,30,118.750,100.00,1566.666667,SALES,CHICAGO
11,7782,CLARK,MGR,7839.0,1981-06-09,2450.0,2450.0,10,551.250,100.00,2916.666667,ACCOUNTING,NEW YORK
12,7839,KING,Country_Head,NaN,1981-11-17,5000.0,5000.0,10,1375.000,100.00,2916.666667,ACCOUNTING,NEW YORK
13,7934,MILLER,CLK,7782.0,1982-01-23,1300.0,1300.0,10,227.500,100.00,2916.666667,ACCOUNTING,NEW YORK

In [110]:
#update dnames with the mapping values provided by downstream application
dname_map={'RESEARCH':'R&D','SALES':'SALES','ACCOUNTING':'ACCT'}
final=final.replace({'dname':dname_map})
final

,empno,ename,job,mgr,hiredate,sal,comm,deptno,Tax,comm_%,avg_sal,dname,loc
0,7369,SMITH,CLK,7902.0,1980-12-17,800.0,800.0,20,100.000,100.00,2175.000000,R&D,DALLAS
1,7566,JONES,MGR,7839.0,1981-04-02,2975.0,2975.0,20,818.125,100.00,2175.000000,R&D,DALLAS
2,7788,SCOTT,SDE2,7566.0,1987-04-19,3000.0,3000.0,20,825.000,100.00,2175.000000,R&D,DALLAS
3,7876,ADAMS,CLK,7788.0,1987-05-23,1100.0,1100.0,20,137.500,100.00,2175.000000,R&D,DALLAS
4,7902,FORD,SDE2,7566.0,1981-12-03,3000.0,3000.0,20,825.000,100.00,2175.000000,R&D,DALLAS
5,7499,ALLEN,Sales&Marketing,7698.0,1981-02-20,1600.0,300.0,30,280.000,18.75,1566.666667,SALES,CHICAGO
6,7521,WARD,Sales&Marketing,7698.0,1981-02-22,1250.0,500.0,30,156.250,40.00,1566.666667,SALES,CHICAGO
7,7654,MARTIN,Sales&Marketing,7698.0,1981-09-28,1250.0,1400.0,30,156.250,112.00,1566.666667,SALES,CHICAGO
8,7698,BLAKE,MGR,7839.0,1981-05-01,2850.0,2850.0,30,783.750,100.00,1566.666667,SALES,CHICAGO
9,7844,TURNER,Sales&Marketing,7698.0,1981-09-08,1500.0,1500.0,30,262.500,100.00,1566.666667,SALES,CHICAGO
10,7900,JAMES,CLK,7698.0,1981-12-03,950.0,950.0,30,118.750,100.00,1566.666667,SALES,CHICAGO
11,7782,CLARK,MGR,7839.0,1981-06-09,2450.0,2450.0,10,551.250,100.00,2916.666667,ACCT,NEW YORK
12,7839,KING,Country_Head,NaN,1981-11-17,5000.0,5000.0,10,1375.000,100.00,2916.666667,ACCT,NEW YORK
13,7934,MILLER,CLK,7782.0,1982-01-23,1300.0,1300.0,10,227.500,100.00,2916.666667,ACCT,NEW YORK

In [111]:
#final dataframe contains selective columns to be inserted into table
cleaned_df=final[['empno','ename','job','hiredate','sal','Tax','avg_sal','dname','loc']]
cleaned_df

,empno,ename,job,hiredate,sal,Tax,avg_sal,dname,loc
0,7369,SMITH,CLK,1980-12-17,800.0,100.000,2175.000000,R&D,DALLAS
1,7566,JONES,MGR,1981-04-02,2975.0,818.125,2175.000000,R&D,DALLAS
2,7788,SCOTT,SDE2,1987-04-19,3000.0,825.000,2175.000000,R&D,DALLAS
3,7876,ADAMS,CLK,1987-05-23,1100.0,137.500,2175.000000,R&D,DALLAS
4,7902,FORD,SDE2,1981-12-03,3000.0,825.000,2175.000000,R&D,DALLAS
5,7499,ALLEN,Sales&Marketing,1981-02-20,1600.0,280.000,1566.666667,SALES,CHICAGO
6,7521,WARD,Sales&Marketing,1981-02-22,1250.0,156.250,1566.666667,SALES,CHICAGO
7,7654,MARTIN,Sales&Marketing,1981-09-28,1250.0,156.250,1566.666667,SALES,CHICAGO
8,7698,BLAKE,MGR,1981-05-01,2850.0,783.750,1566.666667,SALES,CHICAGO
9,7844,TURNER,Sales&Marketing,1981-09-08,1500.0,262.500,1566.666667,SALES,CHICAGO
10,7900,JAMES,CLK,1981-12-03,950.0,118.750,1566.666667,SALES,CHICAGO
11,7782,CLARK,MGR,1981-06-09,2450.0,551.250,2916.666667,ACCT,NEW YORK
12,7839,KING,Country_Head,1981-11-17,5000.0,1375.000,2916.666667,ACCT,NEW YORK
13,7934,MILLER,CLK,1982-01-23,1300.0,227.500,2916.666667,ACCT,NEW YORK

In [88]:
#write the final df to table 
cleaned_df.to_sql('emp_dept',con=engine,if_exists='replace',index=False)

In [9]:
for i in range (0, 5):
    for j in range (0, i + 1):
        print("*", end='')
    print("\r")
for i in range (5, 0, -1):
    for j in range(0, i -1):
        print("*", end='')
    print("\r")

*

*
*

*
*
*

*
*
*
*

*
*
*
*
*

****
***
**
*